STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_MultipleConnections_Central/STM32_BLE/App/app_ble.c
    if(num_returned_devices == 0){
      break;
    }
    num_bonded_devices += num_returned_devices;    
  }
  
  return num_bonded_devices;
}

/**
* @brief  Initiates the auto connection establishment procedure if bonded devices are found.
* 
* This function checks immediately if there are any bonded devices (in this scenario, peripheral bonded devices could be found).
* If the check is true, it means that a connection with a peripheral was previously established, and the auto connection establishment
* procedure can be started correctly.
* 
* @retval None
*/
static void Start_Auto_Connection(void)
{  
  uint32_t status, paramA = SCAN_INT_MS(500), paramB = SCAN_WIN_MS(500);
  
  if (bleAppContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
  {
    status = aci_gap_configure_filter_accept_and_resolving_list(0x01);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : (FILTER) aci_gap_configure_filter_accept_and_resolving_list command, result: 0x%02X\n", status);
    }
    else
    {
      APP_DBG_MSG("  Success: (FILTER) aci_gap_configure_filter_accept_and_resolving_list command\n");
    }
  }
  
  status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, 0x00, LE_1M_PHY_BIT, HCI_SCAN_TYPE_ACTIVE, paramA, paramB);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("(FILTER) aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_scan_configuration - Success\n");
  }
  
  status = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                CONN_INT_MS(50u), 
                                                CONN_INT_MS(100u),
                                                0u,
                                                CONN_SUP_TIMEOUT_MS(5000u),
                                                CONN_CE_LENGTH_MS(10u), 
                                                CONN_CE_LENGTH_MS(10u));
  
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_connection_configuration Success , result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> (FILTER) aci_gap_set_connection_configuration Failed , result: 0x%02X\n", status);
  }  
  
  /* Start the auto connection establishment procedure */
  status = aci_gap_start_procedure(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC, LE_1M_PHY_BIT, 0, 0);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("(FILTER) aci_gap_start_procedure GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n", status);
  }
  else
  {
    bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING_AUTO_CONNECTION;
    APP_DBG_MSG("==>> (FILTER) aci_gap_start_procedure GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
  }
  
  return;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */



#if (CFG_BUTTON_SUPPORTED == 1)

void APPE_Button1Action(void)
{
  APP_DBG_MSG("  In Central Role, the normal push button is not assigned to any action. Please use the long push button. \n");
  return;
}

void APPE_Button2Action(void)
{
  APP_DBG_MSG("  In Central Role, the normal push button is not assigned to any action. Please use the long push button. \n");
  return;
}

void APPE_Button3Action(void)
{
  APP_DBG_MSG("  In Central Role, the normal push button is not assigned to any action. Please use the long push button. \n");
  return;
}

/**
* @brief  Handles the action for TASK_BUTTON_1_LONG_PRESS press event.
* 
* This function is called when Button 1 (B1) is long pressed. If the device is not connected as a client,
* it prints the list of bonded devices. If no bonded devices are found, it starts the scan procedure.
* Otherwise, it starts the auto connection procedure.
* 
* @retval None
*/
void APPE_Button1LongPressAction(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING_AUTO_CONNECTION)
  {
    
    APP_DBG_MSG("APP_BLE_LP_CONNECTING_AUTO_CONNECTION is running\n");
    
    uint8_t status = aci_gap_terminate_proc(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("aci_gap_terminate_gap_proc - GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n",status);
    }
    else
    {
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
      APP_DBG_MSG("==>> aci_gap_terminate_gap_proc - GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
    }
  }
  
  /* Check if the device is not connected as a BLE client */
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    /* Print the list of bonded devices */
    Print_Bonded_Devices();
    
    /* Check if there are no bonded devices */
    if(Get_Num_Bonded_Devices() == 0)
    {
      APP_BLE_Procedure_Gap_Central(PROC_GAP_CENTRAL_SCAN_START);
    }
    else
    {     
      Start_Auto_Connection();
    }  
  }
  
  return;
}

/**
* @brief  Handles the action for TASK_BUTTON_2_LONG_PRESS press event.
* 
* This function is called when Button 2 (B2) is long pressed. If the device is connected as a BLE client,
* it sets a new task to start the procedure for writing the peripheral characteristic. Otherwise, it
* calls the function to clear the security database.
* 
* @retval None
*/
void APPE_Button2LongPressAction(void)
{
  /* Check if the device is connected as a BLE client */
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT)
  {
    /* Set the task to start the procedure for writing the peripheral characteristic */
    UTIL_SEQ_SetTask( 1u << CFG_TASK_WRITE_CHAR_ID, CFG_SEQ_PRIO_0);
  }
  else
  {
    /* Clear the security database if not connected as a BLE client */
    tBleStatus ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  return;
}


/**
* @brief  Handles the action for TASK_BUTTON_3_LONG_PRESS press event.
* 
* This function is called when B3 is long pressed. It terminates the current BLE connection
* if the device is connected as a client. 
* 
* @return void
*/
void APPE_Button3LongPressAction(void)
{
  /* Check if the device is connected as a BLE client */
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_CLIENT)
  {
    /* Use this task to terminate the connection. This ensures that the disconnection reason is set 
    to BLE_ERROR_TERMINATED_REMOTE_USER */
    APP_DBG_MSG("APPE_Button3Action - CFG_TASK_TERMINATE_CONNECTION\n");
    UTIL_SEQ_SetTask(1U << CFG_TASK_TERMINATE_CONNECTION, CFG_SEQ_PRIO_0);
    return;
  }
  
  if(bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING_AUTO_CONNECTION)
  {
    APP_DBG_MSG("APPE_Button3Action - bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING_AUTO_CONNECTION \n");
    uint8_t status = aci_gap_terminate_proc(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC);
    if (status != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("aci_gap_terminate_gap_proc GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - fail, result: 0x%02X\n",status);
    }
    else
    {
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
      APP_DBG_MSG("==>> aci_gap_terminate_gap_proc GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC - Success\n");
    }
    return;
  }
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
